#+NAME: Combining observational and ISMIP freshwater forcing

*** Greenland obs table

#+BEGIN_SRC jupyter-python :exports both
obs_GL
#+END_SRC

#+RESULTS:
| Date                | Gt/yr |
|---------------------+-------|
| 1990-01-01 00:00:00 | 137.6 |
| 1991-01-01 00:00:00 |  76.7 |
| 1992-01-01 00:00:00 |     0 |
| 1993-01-01 00:00:00 |   3.6 |
| 1994-01-01 00:00:00 | 113.8 |
| 1995-01-01 00:00:00 | 211.9 |
| 1996-01-01 00:00:00 |     0 |
| 1997-01-01 00:00:00 |     0 |
| 1998-01-01 00:00:00 |   102 |
| 1999-01-01 00:00:00 |    47 |
| 2000-01-01 00:00:00 |  77.1 |
| 2001-01-01 00:00:00 |  26.1 |
| 2002-01-01 00:00:00 | 142.5 |
| 2003-01-01 00:00:00 | 167.2 |
| 2004-01-01 00:00:00 | 165.8 |
| 2005-01-01 00:00:00 | 168.4 |
| 2006-01-01 00:00:00 | 239.8 |
| 2007-01-01 00:00:00 | 257.3 |
| 2008-01-01 00:00:00 | 201.2 |
| 2009-01-01 00:00:00 |   243 |
| 2010-01-01 00:00:00 | 376.8 |
| 2011-01-01 00:00:00 | 336.2 |
| 2012-01-01 00:00:00 | 429.3 |
| 2013-01-01 00:00:00 | 107.9 |
| 2014-01-01 00:00:00 | 184.6 |
| 2015-01-01 00:00:00 | 213.9 |
| 2016-01-01 00:00:00 |   256 |
| 2017-01-01 00:00:00 | 102.6 |
| 2018-01-01 00:00:00 |  75.8 |
| 2019-01-01 00:00:00 |   426 |


*** Uncertainty

From [[citet:slater_2021][Slater (2021)]] Table 1

| Component          | Uncertainty [Gt yr^{-1}] |
|--------------------+--------------------------|
| Ice shelf calving  |                       36 |
| Ice shelf thinning |                       39 |
| Antarctic land ice |                       24 |
|--------------------+--------------------------|
| mean               |                       33 |
| sum                |                       99 |
#+TBLFM: @5$2=vmean(@2..@-1)::@6$2=vsum(@2..@4)

+ Assume these are 1 \sigma uncertainty
+ lo/mid/hi estimates can use mean (33), max (39) or sum (99)

**** If fields are random

#+BEGIN_SRC jupyter-python :exports both
from uncertainties import unumpy
import numpy as np
np.sum(unumpy.uarray([1,1,1], [36,39,24]))
#+END_SRC

#+RESULTS:
: 3.0+/-58.249463516842795

*** Table

#+CAPTION: Annual Antarctic ice mass loss from ISMIP6 245
#+BEGIN_SRC jupyter-python :exports both
ismip_AQ
#+END_SRC

#+RESULTS:
| Date                |    50 |   17 |    83 |
|---------------------+-------+------+-------|
| 2020-01-01 00:00:00 |  2160 | 1440 |  3240 |
| 2030-01-01 00:00:00 |  3960 | 2520 |  5400 |
| 2040-01-01 00:00:00 |  6120 | 3600 |  8640 |
| 2050-01-01 00:00:00 |  8640 | 5040 | 12600 |
| 2060-01-01 00:00:00 | 11520 | 6120 | 16920 |
| 2070-01-01 00:00:00 | 14580 | 6120 | 22680 |
| 2080-01-01 00:00:00 | 18000 | 6480 | 29221 |
| 2090-01-01 00:00:00 | 23760 | 8640 | 38581 |
| 2100-01-01 00:00:00 | 28800 | 9720 | 50040 |

* Output                                                :noexport:

#+BEGIN_SRC jupyter-python

def writer(da, fname):
    dd = da.copy(deep=True)
    dd.index = dd.index.year
    dd.to_csv(fname, sep='\t', header=False)

writer(df_AQ[17], './out/AQ_17.csv')
writer(df_AQ[50], './out/AQ_50.csv')
writer(df_AQ[83], './out/AQ_83.csv')
writer(df_GL[17], './out/GL_17.csv')
writer(df_GL[50], './out/GL_50.csv')
writer(df_GL[83], './out/GL_83.csv')
#+END_SRC

#+RESULTS:
TEX_HEADER_EXTRA:             style=authoryear,
#+LATEX_HEADER_EXTRA:             %defernumbers=true, 
#+LATEX_HEADER_EXTRA:             firstinits=true, 
#+LATEX_HEADER_EXTRA:             uniquename=false,
#+LATEX_HEADER_EXTRA:             uniquelist=false,
#+LATEX_HEADER_EXTRA:             %uniquelist=minyear,
#+LATEX_HEADER_EXTRA:             maxnames=99, 
#+LATEX_HEADER_EXTRA:             maxcitenames=1]{biblatex}
#+LATEX_HEADER_EXTRA:\addbibresource{/home/kdm/Documents/Papers/library.bib}
#+LATEX_HEADER_EXTRA:\addbibresource{/home/kdm/Documents/Papers/software.bib}
#+LATEX_HEADER_EXTRA:\addbibresource{/home/kdm/Documents/Papers/data.bib}
#+LATEX_HEADER_EXTRA: \renewbibmacro{in:}{}

# biber <texfile><.NOEXT> --output_format bibtex
# biber --output_format=bibtex --output_resolve ${fn}.bcf

# http://tex.stackexchange.com/a/5779/360
#+LATEX_HEADER_EXTRA: % Don't print URL if DOI field exists
#+LATEX_HEADER_EXTRA: \DeclareFieldFormat{url}{%
#+LATEX_HEADER_EXTRA:   \iffieldundef{doi}{%
#+LATEX_HEADER_EXTRA:     \mkbibacro{URL}\addcolon\space\url{#1}%
#+LATEX_HEADER_EXTRA:   }{%
#+LATEX_HEADER_EXTRA:   }%
#+LATEX_HEADER_EXTRA: }
#+LATEX_HEADER_EXTRA: % Don't print URL if DOI field exists
#+LATEX_HEADER_EXTRA: \DeclareFieldFormat{urldate}{%
#+LATEX_HEADER_EXTRA:   \iffieldundef{doi}{%
#+LATEX_HEADER_EXTRA:     \mkbibparens{\bibstring{urlseen}\space#1}%
#+LATEX_HEADER_EXTRA:   }{%
#+LATEX_HEADER_EXTRA:   }%
#+LATEX_HEADER_EXTRA: }

#+LATEX_HEADER_EXTRA: \renewbibmacro*{journal+issuetitle}{%
#+LATEX_HEADER_EXTRA: \usebibmacro{journal}%
#+LATEX_HEADER_EXTRA: \setunit*{\addspace}%
#+LATEX_HEADER_EXTRA: \iffieldundef{series}
#+LATEX_HEADER_EXTRA: {}
#+LATEX_HEADER_EXTRA: {\newunit
#+LATEX_HEADER_EXTRA: \printfield{series}%
#+LATEX_HEADER_EXTRA: \setunit{\addspace}}%
#+LATEX_HEADER_EXTRA: \usebibmacro{issue+date}%
#+LATEX_HEADER_EXTRA: \setunit{\addcomma\space}%
#+LATEX_HEADER_EXTRA: \usebibmacro{volume+number+eid}%
#+LATEX_HEADER_EXTRA: \setunit{\addcolon\space}%
#+LATEX_HEADER_EXTRA: \usebibmacro{issue}%
#+LATEX_HEADER_EXTRA: \newunit}

#+LATEX_HEADER_EXTRA: \newbibmacro*{issue+date}{%
#+LATEX_HEADER_EXTRA: \iffieldundef{issue}
#+LATEX_HEADER_EXTRA: {. \usebibmacro{date}}
#+LATEX_HEADER_EXTRA: {\printfield{issue}%
#+LATEX_HEADER_EXTRA: \setunit*{\addspace}%
#+LATEX_HEADER_EXTRA: \usebibmacro{date}}%
#+LATEX_HEADER_EXTRA: \newunit}

#+LATEX_HEADER_EXTRA: \renewbibmacro*{volume+number+eid}{%
#+LATEX_HEADER_EXTRA: \printfield{volume}%
#+LATEX_HEADER_EXTRA: \setunit*{\addnbspace}% NEW (optional); there's also #+LATEX_HEADER_EXTRA: \addnbthinspace
#+LATEX_HEADER_EXTRA: \printfield{number}%
#+LATEX_HEADER_EXTRA: \setunit{\addcomma\space}%
#+LATEX_HEADER_EXTRA: \printfield{eid}}
#+LATEX_HEADER_EXTRA: \DeclareFieldFormat[article]{number}{\mkbibparens{#1}}

#+LATEX_HEADER_EXTRA: \DeclareFieldFormat{pages}{#1}

